package NetCoding;

public class Java01 {
    /*
    * BS架构（不需要下载安装的）
    * 优缺点：不需要开发客户端，只需要页面+服务器
    * 用户不需要下载，打开浏览器就能使用
    * 如果应用过大，用户体验收到影响
    * CS架构（需要下载安装的）
    * 优缺点：画面可以做的非常精美，用户体验好
    * 需要开发客户端，也需要开发服务端
    * 用户需要下载和更新的时候太麻烦
    *
    * 网络编程三要素
    * 确定接受数据的软件（端口号）
    * 确定网络传输的规则（协议 UDP TCP http https ftp）
    * 确定设备在网络中的地址，是唯一的标识（IP）
    * */


    // IP: 是互联网协议地址，也称IP地址，是分配给上网设备在网络中的地址，是唯一的
    // 常见的IP分类为IPv4、IPv6
    // IPv4:InternetProtocol version 4, 互联网通信协议第四版
    // 采用32位长度，分成4组，每组最多255种，最多只有42亿多
    // IPv6:InternetProtocol version 6, 互联网通信协议第六版
    // 采用128位地址长度，分成8组，相当于2的128次方个ip
    // 冒分十六进制，通过冒号分割十六进制，如果里面有0的话可以省略前面的0
    // 比如2001:0DB8:0000:0023:0008:0800:200C:417A
    // 可以省略为2001:DB8:23:8:800:200C:417A
    // 特殊情况：如果计算出的16进制表示形式中间有多个连续的0
    // 就会自动把0去掉，0位压缩表示法

}
